<!-- add-pr-comment:poc-tfplan -->

Terraform plan output for poc

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backstage.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-1:884360309640:service/arc-poc-cluster/arc-poc-cluster-backstage"
        name                               = "arc-poc-cluster-backstage"
        tags                               = {
            "Environment" = "poc"
            "MonoRepo"    = "False"
            "Name"        = "arc-poc-cluster-backstage"
            "Project"     = "arc"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:884360309640:task-definition/arc-poc-cluster-backstage:20" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backstage.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "BASE_URL"
                          + value = "https://dx.arc-poc.link"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "FRONTEND_BASE_URL"
                          + value = "https://dx.arc-poc.link"
                        },
                    ]
                  + essential              = true
                  + interactive            = false
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/backstage/arc-poc-cluster-backstage"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name                   = "arc-poc-cluster-backstage"
                  + portMappings           = [
                      + {
                          + containerPort = 7007
                          + hostPort      = 7007
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "ENABLE_GITHUB_SYNC"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:ENABLE_GITHUB_SYNC::"
                        },
                      + {
                          + name      = "POSTGRES_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:POSTGRES_USER::"
                        },
                      + {
                          + name      = "POSTGRES_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:POSTGRES_PASSWORD::"
                        },
                      + {
                          + name      = "GITHUB_TOKEN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:GITHUB_TOKEN::"
                        },
                      + {
                          + name      = "AUTH_GITHUB_CLIENT_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:AUTH_GITHUB_CLIENT_ID::"
                        },
                      + {
                          + name      = "AUTH_GITHUB_CLIENT_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:AUTH_GITHUB_CLIENT_SECRET::"
                        },
                      + {
                          + name      = "POSTGRES_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:POSTGRES_HOST::"
                        },
                      + {
                          + name      = "POSTGRES_PORT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:POSTGRES_PORT::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_APP_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:INTEGRATION_GITHUB_APP_ID::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_WEBHOOK_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:INTEGRATION_GITHUB_WEBHOOK_URL::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_CLIENT_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:INTEGRATION_GITHUB_CLIENT_ID::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_CLIENT_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:INTEGRATION_GITHUB_CLIENT_SECRET::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_WEBHOOK_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:INTEGRATION_GITHUB_WEBHOOK_SECRET::"
                        },
                      + {
                          + name      = "SNYK_TOKEN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-rXENfZ:SNYK_TOKEN::"
                        },
                      + {
                          + name      = "INTEGRATION_GITHUB_PRIVATE_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:884360309640:secret:arc/poc/sf-arc-poc2-backstage-private-key-inX6Wn"
                        },
                    ]
                  + startTimeout           = 30
                  + stopTimeout            = 30
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::884360309640:role/backstage-poc-execution"
      + family                   = "arc-poc-cluster-backstage"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "poc"
          + "MonoRepo"    = "False"
          + "Name"        = "arc-poc-cluster-backstage"
          + "Project"     = "arc"
        }
      + tags_all                 = {
          + "Environment" = "poc"
          + "MonoRepo"    = "False"
          + "Name"        = "arc-poc-cluster-backstage"
          + "Project"     = "arc"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

